code-review/NRB_3471_3546/База_Стало/Reports/ОстаткиИОбороты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОстаткиИОбороты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеДополнительныхПолей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоказателиВРазныхКолонках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскрашиватьИзмерения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ОстаткиИОбороты/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

Перем мСтруктураКэшДанных;

#КонецОбласти 

#Область ПрограммныйИнтерфейс

Функция СхемаПоРазделу() Экспорт
	                       
	СКД = ЭтотОбъект.СхемаКомпоновкиДанных;	
	НаборДанных = СКД.НаборыДанных[0];
	НаборДанных.Запрос =  ТекстЗапросаНабораДанных(); 
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	ДобавитьИтогиРегистра(СКД);
	
	УстановитьСтандартныеНастройки(СКД.НастройкиПоУмолчанию);

	Возврат СКД;
	
КонецФункции

Процедура УстановитьПериод(Компоновщик) Экспорт
	
	ПериодОтчета = Новый СтандартныйПериод(ЭтотОбъект.ДатаНачала, ЭтотОбъект.ДатаОкончания);	
	Компоновщик.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ПериодОтчета);
	
КонецПроцедуры
 
Процедура ИнициализироватьКомпоновщик(Компоновщик, КлючФормы = Неопределено, СКД = Неопределено) Экспорт
	
	ЗаполнитьНастройки = Ложь;
	Если СКД = Неопределено Тогда
		СКД = СхемаПоРазделу();
		АдресСхемы = ПоместитьВоВременноеХранилище(СКД, КлючФормы);
		идн = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
		ЗаполнитьНастройки = Истина;
	Иначе
		идн = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);		
	КонецЕсли; 
	
	Компоновщик.Инициализировать(идн);	
	ЗагрузитьНастройкиРаздела(Компоновщик);			
	УстановитьПериод(Компоновщик);
	
	Если ЗаполнитьНастройки Тогда 
		ЗаполнитьТабличныеЧастиОтчетаПоКомпоновщику(Компоновщик);
	КонецЕсли;
	
КонецПроцедуры 

Процедура СохранитьНастройкиРаздела(Компоновщик) Экспорт
	
	Ключи = КлючиОбщихНастроек();	
	НастройкиКомпоновщика = Компоновщик.ПолучитьНастройки();
	
	// Группировки
	НастройкиКомпоновщика.УсловноеОформление.Элементы.Очистить();
	НастройкиКомпоновщика.Структура.Очистить();	
	Структура = НастройкиКомпоновщика.Структура;
	
	Для Каждого ПолеВыбраннойГруппировки Из Группировка Цикл 
		Если ПолеВыбраннойГруппировки.Использование Тогда
			Если НастройкиКомпоновщика.Структура.Количество() = 0 Тогда 
				Структура = Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			Иначе 
				Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			КонецЕсли;
			
			ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Использование = Истина;
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ПолеВыбраннойГруппировки.Поле);
			
			Если ПолеВыбраннойГруппировки.ТипГруппировки = 1 Тогда 
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
			ИначеЕсли ПолеВыбраннойГруппировки.ТипГруппировки = 2 Тогда 
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
			Иначе 
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
			КонецЕсли;
			
			Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			
			Если Лев(ПолеВыбраннойГруппировки.Поле, 8) = "Периоды." Тогда 
				УсловноеОформление = НастройкиКомпоновщика.УсловноеОформление.Элементы.Добавить();
				УсловноеОформление.Использование = Истина;
				ПолеУсловногоОформления = УсловноеОформление.Поля.Элементы.Добавить();
				ПолеУсловногоОформления.Использование = Истина;
				ПолеУсловногоОформления.Поле = ПолеГруппировки.Поле;
				УсловноеОформление.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Формат"), ФорматнаяСтрокаПоПериоду(ПолеГруппировки.Поле));
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Детальные записи
	ИспользованиеДетальныхЗаписей = Ложь;
	Для Каждого ДополнительноеПоле Из ДополнительныеПоля Цикл 
		Если ДополнительноеПоле.Использование Тогда 
			ПозицияТочки = Найти(ДополнительноеПоле.Поле, ".");
			Если ПозицияТочки = 0 Тогда 
				ПолеДляПоиска = ДополнительноеПоле.Поле;
			Иначе 
				ПолеДляПоиска = Лев(ДополнительноеПоле.Поле, ПозицияТочки - 1);
			КонецЕсли;
			
			Если Группировка.Найти(ПолеДляПоиска, "Поле") = Неопределено Тогда
				ИспользованиеДетальныхЗаписей = Истина;
				Прервать;
			КонецЕсли;						
		КонецЕсли;
	КонецЦикла;
	
	Если НастройкиКомпоновщика.Структура.Количество() = 0 Тогда 
		Структура = Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Иначе 
		Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	КонецЕсли;
	Структура.Использование = ИспользованиеДетальныхЗаписей;
	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	// Доп.поля
	НастройкиКомпоновщика.Выбор.Элементы.Очистить();
	
	Для Номер = 1 По 4 Цикл 
		
		Если Номер = 1 Тогда 
			ЗаголовокГруппы = "Нач. остаток";
			ЗначениеПодстановки = "НачальныйОстаток";
		ИначеЕсли Номер = 2 Тогда 
			ЗаголовокГруппы = "Приход";
			ЗначениеПодстановки = "Приход";
		ИначеЕсли Номер = 3 Тогда 
			ЗаголовокГруппы = "Расход";
			ЗначениеПодстановки = "Расход";
		Иначе 
			ЗаголовокГруппы = "Кон. остаток";
			ЗначениеПодстановки = "КонечныйОстаток";
		КонецЕсли;
		
		ГруппаПоказатели = НастройкиКомпоновщика.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ГруппаПоказатели.Заголовок = ЗаголовокГруппы;
		ГруппаПоказатели.Использование = Истина;
		Если ВыводитьПоказателиВРазныхКолонках Тогда 
			ГруппаПоказатели.Расположение = РасположениеПоляКомпоновкиДанных.Горизонтально;
		Иначе 			
			ГруппаПоказатели.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
		КонецЕсли;
		
		Для Каждого Показатель Из Показатели Цикл 
			Если Показатель.Использование Тогда 
				ВыбранноеПоле = ГруппаПоказатели.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(Показатель.Поле + ЗначениеПодстановки);
				ВыбранноеПоле.Заголовок = Показатель.Поле;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
		
	Если РазмещениеДополнительныхПолей = 1 Тогда 
		РасположениеРеквизитов = РасположениеРеквизитовКомпоновкиДанных.Отдельно;
	Иначе 
		РасположениеРеквизитов = РасположениеРеквизитовКомпоновкиДанных.ВместеСВладельцем;
	КонецЕсли;
	
	ЗначениеПараметраВывода = НастройкиКомпоновщика.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
	Если ЗначениеПараметраВывода <> Неопределено Тогда 
		ЗначениеПараметраВывода.Использование = Истина;
		ЗначениеПараметраВывода.Значение = РасположениеРеквизитов;
	КонецЕсли;
	
	Для Каждого ДополнительноеПоле Из ДополнительныеПоля Цикл 
		Если ДополнительноеПоле.Использование Тогда 
			
			Поле = Новый ПолеКомпоновкиДанных(ДополнительноеПоле.Поле);
			ВыбранноеПоле = НастройкиКомпоновщика.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Поле;
			
		КонецЕсли;
	КонецЦикла;	
	
	ЭтотОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщика);	
	
	ХранилищеОбщихНастроек.Сохранить(Ключи.КлючОбъекта, Ключи.КлючНастроек, НастройкиКомпоновщика);
	
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	СКД = СхемаПоРазделу();
	ИнициализироватьКомпоновщик(ЭтотОбъект.КомпоновщикНастроек, , СКД);
	Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СинонимРаздела", МетаРегистр().Синоним + ": остатки и обороты");
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПредставлениеПериода", ПредставлениеПериодаОтчета());	
	
	СхемаИзМакета = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	СкопироватьПараметрыВывода(Настройки.ПараметрыВывода, СхемаИзМакета.НастройкиПоУмолчанию.ПараметрыВывода);
	ПараметрВывода = Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
	Если ПараметрВывода <> Неопределено Тогда 
		ПараметрВывода.Использование = Ложь;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Если РаскрашиватьИзмерения Тогда
		МакетОформления = БиблиотекаМакетовОформленияКомпоновкиДанных.Античный.ПолучитьМакет();
	Иначе
		МакетОформления = ПолучитьМакет("МакетОформленияТолькоГраницы");	
	КонецЕсли;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки, МакетОформления);
	
	ПроцКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ПроцВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцВывода.УстановитьДокумент(ДокументРезультат);
	ПроцВывода.Вывести(ПроцКомпоновки, Истина);	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область Сервис

Функция МетаРегистр()
	
	Если НЕ мСтруктураКэшДанных.Свойство("МетаРегистр") Тогда
		МетаРегистр = Метаданные.РегистрыНакопления[ЭтотОбъект.Раздел];
		мСтруктураКэшДанных.Вставить("МетаРегистр", МетаРегистр);		
	КонецЕсли; 
	
	Возврат мСтруктураКэшДанных.МетаРегистр;
	
КонецФункции 

Функция ПредставлениеПериодаОтчета()
	
	Если ДатаНачала = '00010101000000' И ДатаОкончания = '00010101000000' Тогда
		ОписаниеПериода = "Период не установлен";
	Иначе
		Если ДатаНачала = '00010101000000' ИЛИ ДатаОкончания = '00010101000000' Тогда
			ОписаниеПериода = "" + Формат(ДатаНачала, "ДФ = ""дд.ММ.гггг""; ДП = ""...""") 
							+ " - "      + Формат(ДатаОкончания, "ДФ = ""дд.ММ.гггг""; ДП = ""...""");

		Иначе
			Если ДатаНачала <= ДатаОкончания Тогда
				ОписаниеПериода = "" + ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания), "ФП = Истина");
			Иначе
				ОписаниеПериода = "Неправильно задан период!";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ОписаниеПериода;
КонецФункции
 
#КонецОбласти 

#Область ГенерацияСхемы

Функция ТекстЗапросаНабораДанных()
	Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	| $ИменаПолей
	| ИЗ РегистрНакопления." + ЭтотОбъект.Раздел +
	".ОстаткиИОбороты ({&НачалоПериода}, {&КонецПериода}, Авто)";
	
	МетаРегистр = МетаРегистр();
	
	ТипыПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("Ресурсы,Измерения", ",");
	СуффиксыРесурсов =  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("НачальныйОстаток,КонечныйОстаток,Приход,Расход,Оборот", ",");
	СуффиксыИзмерений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("");
	
	ИменаПолей = "";
	Для каждого ТипПоля Из ТипыПолей Цикл
		
		Если ТипПоля = "Ресурсы" Тогда
			Суффиксы = СуффиксыРесурсов;
		Иначе
			Суффиксы = СуффиксыИзмерений;			
		КонецЕсли; 
		
		Для каждого МетаПоле Из МетаРегистр[ТипПоля] Цикл						
			Для каждого Суффикс Из Суффиксы Цикл		
				Разделитель = ?(ЗначениеЗаполнено(ИменаПолей), "," + Символы.ПС + Символы.Таб, "");
				ИменаПолей = ИменаПолей + Разделитель + МетаПоле.Имя + Суффикс;
			КонецЦикла; 										
		КонецЦикла; 		
	КонецЦикла; 
	
	Разделитель = ?(ЗначениеЗаполнено(ИменаПолей), "," + Символы.ПС + Символы.Таб, "");
	ИменаПолей = ИменаПолей + Разделитель + "Регистратор, ПериодСекунда, ПериодДень, ПериодНеделя, ПериодДекада, ПериодМесяц, ПериодКвартал, ПериодПолугодие, ПериодГод";
	
	Результат = СтрЗаменить(Результат, "$ИменаПолей", ИменаПолей);	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьИтогиРегистра(СКД)
	
	СКД.НаборыДанных[0].Поля.Очистить();
	
	МетаРегистр = МетаРегистр();
	
	// Добавляем измерения
	Для каждого Измерение Из МетаРегистр.Измерения Цикл
		ПолеНабора = ДобавитьПолеНабораДанных(СКД.НаборыДанных[0], Измерение.Имя, Измерение.Синоним);
		ПолеНабора.Роль.Измерение = Истина;
	КонецЦикла;
	
	ПолеНабораДанных = СКД.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораДанных.Поле        = "Регистратор";
	ПолеНабораДанных.Заголовок   = "Регистратор";
	ПолеНабораДанных.ПутьКДанным = "Регистратор";
	ПолеНабораДанных.Роль.ТипПериода = ТипПериодаКомпоновкиДанных.Основной;
	ПолеНабораДанных.Роль.НомерПериода = 1;
	ПолеНабораДанных.Роль.РеквизитИзмерения = Истина;
	
	ДобавитьПоляПериодаВНаборДанных(СКД.НаборыДанных[0]);
	
	// Добавляем ресурсы
	Для каждого Ресурс Из МетаРегистр.Ресурсы Цикл			
		ПолеНабора = ДобавитьПолеНабораДанных(СКД.НаборыДанных[0], Ресурс.Имя + "НачальныйОстаток", Ресурс.Синоним + " " + НСтр("ru = 'нач. остаток'"), Ресурс.Имя + "НачальныйОстаток");
		ПолеНабора.Роль.ГруппаОстатка = Ресурс.Имя;
		ПолеНабора.Роль.Остаток = Истина;
		ПолеНабора.Роль.ТипОстатка = ТипОстаткаКомпоновкиДанных.НачальныйОстаток;		
		ДобавитьПолеИтога(СКД, Ресурс.Имя + "НачальныйОстаток");
					
		ДобавитьПолеНабораДанных(СКД.НаборыДанных[0], Ресурс.Имя + "Оборот", Ресурс.Синоним + " " + НСтр("ru = 'оборот'"), Ресурс.Имя + "Оборот");
		ДобавитьПолеИтога(СКД, Ресурс.Имя + "Оборот");
		
		ДобавитьПолеНабораДанных(СКД.НаборыДанных[0], Ресурс.Имя + "Приход", Ресурс.Синоним + " " + НСтр("ru = 'приход'"), Ресурс.Имя + "Приход");
		ДобавитьПолеИтога(СКД, Ресурс.Имя + "Приход");
		
		ДобавитьПолеНабораДанных(СКД.НаборыДанных[0], Ресурс.Имя + "Расход", Ресурс.Синоним + " " + НСтр("ru = 'расход'"), Ресурс.Имя + "Расход");
		ДобавитьПолеИтога(СКД, Ресурс.Имя + "Расход");
	
		ПолеНабора = ДобавитьПолеНабораДанных(СКД.НаборыДанных[0], Ресурс.Имя + "КонечныйОстаток", Ресурс.Синоним + " " + НСтр("ru = 'кон. остаток'"), Ресурс.Имя + "КонечныйОстаток");
		ПолеНабора.Роль.ГруппаОстатка = Ресурс.Имя;
		ПолеНабора.Роль.Остаток = Истина;
		ПолеНабора.Роль.ТипОстатка = ТипОстаткаКомпоновкиДанных.КонечныйОстаток;		
		ДобавитьПолеИтога(СКД, Ресурс.Имя + "КонечныйОстаток");
	КонецЦикла;

КонецПроцедуры

// Добавить поле итога в схему компоновки данных. Если параметр Выражение не указан, используется Сумма(ПутьКДанным).
Функция ДобавитьПолеИтога(СхемаКомпоновкиДанных, ПутьКДанным, Выражение = Неопределено)
	
	Если Выражение = Неопределено Тогда
		Выражение = "Сумма(" + ПутьКДанным + ")";
	КонецЕсли;
	
	ПолеИтога = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	ПолеИтога.ПутьКДанным = ПутьКДанным;
	ПолеИтога.Выражение = Выражение;
	Возврат ПолеИтога;
	
КонецФункции

Функция ДобавитьПолеНабораДанных(НаборДанных, Поле, Заголовок, ПутьКДанным = Неопределено)
	
	Если ПутьКДанным = Неопределено Тогда
		ПутьКДанным = Поле;
	КонецЕсли;
	
	ПолеНабораДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораДанных.Поле        = Поле;
	ПолеНабораДанных.Заголовок   = Заголовок;
	ПолеНабораДанных.ПутьКДанным = ПутьКДанным;
	Возврат ПолеНабораДанных;
	
КонецФункции

Функция ДобавитьПоляПериодаВНаборДанных(НаборДанных)
	
	СписокПериодов = Новый СписокЗначений;
	СписокПериодов.Добавить("ПериодСекунда",   НСтр("ru = 'Период секунда'"));
	СписокПериодов.Добавить("ПериодМинута",    НСтр("ru = 'Период минута'"));
	СписокПериодов.Добавить("ПериодЧас",       НСтр("ru = 'Период час'"));
	СписокПериодов.Добавить("ПериодДень",      НСтр("ru = 'Период день'"));
	СписокПериодов.Добавить("ПериодНеделя",    НСтр("ru = 'Период неделя'"));
	СписокПериодов.Добавить("ПериодДекада",    НСтр("ru = 'Период декада'"));
	СписокПериодов.Добавить("ПериодМесяц",     НСтр("ru = 'Период месяц'"));
	СписокПериодов.Добавить("ПериодКвартал",   НСтр("ru = 'Период квартал'"));
	СписокПериодов.Добавить("ПериодПолугодие", НСтр("ru = 'Период полугодие'"));
	СписокПериодов.Добавить("ПериодГод",       НСтр("ru = 'Период год'"));
	
	ИмяПапки = "Периоды";
	СписокПолейНабораДанных = Новый СписокЗначений;
	ПапкаПолейНабораДанных = НаборДанных.Поля.Добавить(Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных"));
	ПапкаПолейНабораДанных.Заголовок   = ИмяПапки;
	ПапкаПолейНабораДанных.ПутьКДанным = ИмяПапки;
	
	ТипПериода = ТипПериодаКомпоновкиДанных.Основной;
	
	Для каждого Период Из СписокПериодов Цикл
		ПолеНабораДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабораДанных.Поле        = Период.Значение;
		ПолеНабораДанных.Заголовок   = Период.Представление;
		ПолеНабораДанных.ПутьКДанным = ИмяПапки + "." + Период.Значение;
		ПолеНабораДанных.Роль.ТипПериода = ТипПериода;
		ПолеНабораДанных.Роль.НомерПериода = СписокПериодов.Индекс(Период) + 2;
		СписокПолейНабораДанных.Добавить(ПолеНабораДанных);
		ТипПериода = ТипПериодаКомпоновкиДанных.Дополнительный;
	КонецЦикла;
	
	Возврат СписокПолейНабораДанных;
	
КонецФункции

#КонецОбласти 

#Область НастройкиСхемы

Процедура УстановитьСтандартныеНастройки(Настройки)
	
	ДобавитьПоказатели(Настройки);
	СформироватьСтруктуру(Настройки);
	
	ЗначениеПараметраВывода = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
	Если ЗначениеПараметраВывода <> Неопределено Тогда 
		ЗначениеПараметраВывода.Значение = РасположениеРеквизитовКомпоновкиДанных.ВместеСВладельцем;
	КонецЕсли;
	
	Настройки.Порядок.Элементы.Очистить();
	
КонецПроцедуры

Процедура ДобавитьПоказатели(НастройкиКД)
	
	НастройкиКД.Выбор.Элементы.Очистить();
	НастройкиКД.Отбор.Элементы.Очистить();
	
	ВыбранныеПоляНачальныйОстаток = НастройкиКД.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ВыбранныеПоляНачальныйОстаток.Заголовок = НСтр("ru = 'Нач. остаток'");
	ВыбранныеПоляНачальныйОстаток.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;

	ВыбранныеПоляПриход = НастройкиКД.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ВыбранныеПоляПриход.Заголовок = НСтр("ru = 'Приход'");
	ВыбранныеПоляПриход.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	ВыбранныеПоляРасход = НастройкиКД.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ВыбранныеПоляРасход.Заголовок = НСтр("ru = 'Расход'");
	ВыбранныеПоляРасход.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	
	ВыбранныеПоляКонечныйОстаток = НастройкиКД.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ВыбранныеПоляКонечныйОстаток.Заголовок = НСтр("ru = 'Кон. остаток'");
	ВыбранныеПоляКонечныйОстаток.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	
	МетаРегистр = МетаРегистр();

	Для Каждого Измерение Из МетаРегистр.Измерения Цикл
		ВыбранныеПоля = НастройкиКД.Выбор;
		ДобавитьВыбранноеПоле(ВыбранныеПоля, Измерение.Имя);
		ДобавитьОтключенныйОтбор(НастройкиКД.Отбор, Измерение.Имя);
	КонецЦикла;
	Для Каждого Ресурс Из МетаРегистр.Ресурсы Цикл
		ДобавитьВыбранноеПоле(ВыбранныеПоляНачальныйОстаток, Ресурс.Имя + "НачальныйОстаток", Ресурс.Синоним);
		ДобавитьВыбранноеПоле(ВыбранныеПоляПриход, Ресурс.Имя + "Приход", Ресурс.Синоним);
		ДобавитьВыбранноеПоле(ВыбранныеПоляРасход, Ресурс.Имя + "Расход", Ресурс.Синоним);
		ДобавитьВыбранноеПоле(ВыбранныеПоляКонечныйОстаток, Ресурс.Имя + "КонечныйОстаток", Ресурс.Синоним);
	КонецЦикла;
				
КонецПроцедуры

// Добавляет выбранное поле компоновки данных.
//
// Параметры:
//   Куда - КомпоновщикНастроекКомпоновкиДанных, НастройкиКомпоновкиДанных, ВыбранныеПоляКомпоновкиДанных -
//       Коллекция в которую требуется добавить выбранное поле.
//   ИмяИлиПолеКД - Строка, ПолеКомпоновкиДанных - Имя поля.
//   Заголовок    - Строка - Необязательный. Представление поля.
//
// Возвращаемое значение:
//   ВыбранноеПолеКомпоновкиДанных - Добавленное выбранное поле.
//
Функция ДобавитьВыбранноеПоле(Куда, ИмяИлиПолеКД, Заголовок = "")
	
	Если ТипЗнч(Куда) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоляКД = Куда.Настройки.Выбор;
	ИначеЕсли ТипЗнч(Куда) = Тип("НастройкиКомпоновкиДанных") Тогда
		ВыбранныеПоляКД = Куда.Выбор;
	Иначе
		ВыбранныеПоляКД = Куда;
	КонецЕсли;
	
	Если ТипЗнч(ИмяИлиПолеКД) = Тип("Строка") Тогда
		ПолеКД = Новый ПолеКомпоновкиДанных(ИмяИлиПолеКД);
	Иначе
		ПолеКД = ИмяИлиПолеКД;
	КонецЕсли;
	
	ВыбранноеПолеКД = ВыбранныеПоляКД.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКД.Поле = ПолеКД;
	Если Заголовок <> "" Тогда
		ВыбранноеПолеКД.Заголовок = Заголовок;
	КонецЕсли;
	
	Возврат ВыбранноеПолеКД;
	
КонецФункции

Процедура ДобавитьОтключенныйОтбор(Отбор, ИмяПоля)	
	Элем = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элем.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элем.Использование = Ложь;
	Элем.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;	
	
КонецПроцедуры
 
// Формирует структуру настроек компоновки данных. Первое измерение помещается в группировку, остальные
// - в подчиненные детальные записи.
//
// Параметры:
//  Настройки - НастройкиКомпоновкиДанных - настройки, чья структура формируется.
//
Процедура СформироватьСтруктуру(Настройки)
	Настройки.Структура.Очистить();	
	МетаРегистр = МетаРегистр();
	
	ИзмеренияРегистра = Новый Массив;
	Для Каждого МетаПоле Из МетаРегистр.Измерения Цикл			
		ИзмеренияРегистра.Добавить(МетаПоле.Имя);
	КонецЦикла;	
	
	ГруппировкаКД = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ГруппировкаКД.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));	
	
	ПолеГруппировки = ГруппировкаКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИзмеренияРегистра[0]);
	ПолеГруппировки.Использование = Истина;
	
	ИзмеренияРегистра.Удалить(0);
		
	ГруппировкаДЗ = ГруппировкаКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДЗ.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ГруппировкаДЗ.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));	
	
КонецПроцедуры

#КонецОбласти 

#Область СохранениеВосстановлениеНастроек

Процедура ЗагрузитьНастройкиРаздела(Компоновщик)
	
	Ключи = КлючиОбщихНастроек();
	
	НастройкиКомпоновщика = ХранилищеОбщихНастроек.Загрузить(Ключи.КлючОбъекта, Ключи.КлючНастроек);
	Если НастройкиКомпоновщика = Неопределено Тогда
		УстановитьСтандартныеНастройкиВКомпоновщик(Компоновщик);
	Иначе
		Попытка
			
			ТекущиеНастройки = Компоновщик.Настройки;
			
			// установка пользовательских настроек
			ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки = "Отбор";
			ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки = "Порядок";
			ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
			
			Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновщика);		
			
			// очистка пользовательских настроек
			ТекущиеНастройки = Компоновщик.Настройки;
			ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки = "";
			ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки = "";
			ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
			
		Исключение
			УстановитьСтандартныеНастройкиВКомпоновщик(Компоновщик);
		КонецПопытки;		
	КонецЕсли; 
	
КонецПроцедуры 

Процедура УстановитьСтандартныеНастройкиВКомпоновщик(Компоновщик)
	НастройкиКомпоновщика = Компоновщик.ПолучитьНастройки();
	УстановитьСтандартныеНастройки(НастройкиКомпоновщика);	
	Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновщика);
КонецПроцедуры 

Функция КлючиОбщихНастроек()
	
	Ключи = Новый Структура;
	Ключи.Вставить("КлючОбъекта", "УниверсальныйОтчетОстаткиОбороты");
	Ключи.Вставить("КлючНастроек", "НастройкиКомпоновщикаРаздела" + ЭтотОбъект.Раздел + ?(РежимРасшифровки = Истина, "Расшифровка", ""));
	
	Возврат Ключи;
	
КонецФункции

#КонецОбласти 

#Область КопированиеНастроек

Процедура СкопироватьПараметрыВывода(Источник, Приемник)
	
	Для каждого Элем Из Источник.Элементы Цикл		
		Приемник.УстановитьЗначениеПараметра(Элем.Параметр, Элем.Значение);		
	КонецЦикла; 
	
КонецПроцедуры
 
#КонецОбласти 

#КонецОбласти 

Процедура ЗаполнитьТабличныеЧастиОтчетаПоКомпоновщику(Компоновщик) Экспорт 
		
	Группировка.Очистить();
	ДополнительныеПоля.Очистить();
	Показатели.Очистить();
	
	ЗаполнитьГруппировки(Компоновщик.Настройки.Структура, Компоновщик.Настройки.ДоступныеПоляГруппировок);

	ГруппаВыбранныхПолейКомпоновкиДанных = Неопределено;
	
	Для Каждого ВыбранноеПоле Из Компоновщик.Настройки.Выбор.Элементы Цикл 
		Если ТипЗнч(ВыбранноеПоле) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			ПозицияТочки = Найти(ВыбранноеПоле.Поле, ".");
			Если ПозицияТочки = 0 Тогда 
				ПолеДляПоиска = ВыбранноеПоле.Поле;
			Иначе 
				ПолеДляПоиска = Лев(ВыбранноеПоле.Поле, ПозицияТочки - 1);
			КонецЕсли;
			
			Поле = Компоновщик.Настройки.ДоступныеПоляВыбора.Элементы.Найти(ПолеДляПоиска);
			Если Поле <> Неопределено Тогда 
				Если ПозицияТочки = 0 Тогда 
					НоваяСтрока = ДополнительныеПоля.Добавить();
					НоваяСтрока.Использование = ВыбранноеПоле.Использование;
					НоваяСтрока.Поле = Поле.Поле;
					НоваяСтрока.Представление = Поле.Заголовок;
				Иначе 
					НоваяСтрока = ДополнительныеПоля.Добавить();
					НоваяСтрока.Использование = ВыбранноеПоле.Использование;
					НоваяСтрока.Поле = ВыбранноеПоле.Поле;
					НоваяСтрока.Представление = ВыбранноеПоле.Поле;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ВыбранноеПоле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			Если ГруппаВыбранныхПолейКомпоновкиДанных = Неопределено Тогда 
				ГруппаВыбранныхПолейКомпоновкиДанных = ВыбранноеПоле;
			КонецЕсли;			
		КонецЕсли;		
	КонецЦикла;
	
	МетаРегистр = МетаРегистр();
	Для Каждого Ресурс Из МетаРегистр.Ресурсы Цикл
		
		Поле = Неопределено;
		Для Каждого ВыбранныйПоказатель Из ГруппаВыбранныхПолейКомпоновкиДанных.Элементы Цикл 
			Если СтрЗаменить(Строка(ВыбранныйПоказатель.Поле), "НачальныйОстаток", "") = Ресурс.Имя Тогда 
				Поле = ВыбранныйПоказатель;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
		
		НоваяСтрока = Показатели.Добавить();
		НоваяСтрока.Использование = ?(Поле = Неопределено, Ложь, Поле.Использование);
		НоваяСтрока.Поле = Ресурс.Имя;
		НоваяСтрока.Представление = Ресурс.Синоним;

	КонецЦикла;	
							 
	ЗначениеПараметраВывода = Компоновщик.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
	Если ЗначениеПараметраВывода <> Неопределено И ЗначениеПараметраВывода.Использование Тогда 
		Если ЗначениеПараметраВывода.Значение = РасположениеРеквизитовКомпоновкиДанных.ВместеСВладельцем Тогда 
			РазмещениеДополнительныхПолей = 0;
		Иначе 
			РазмещениеДополнительныхПолей = 1;
		КонецЕсли;
	Иначе 
		РазмещениеДополнительныхПолей = 0;
	КонецЕсли;
	
	ВыводитьПоказателиВРазныхКолонках = Ложь;
	Для Каждого ПолеВыбора Из Компоновщик.Настройки.Выбор.Элементы Цикл 		
		Если ТипЗнч(ПолеВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда 
			Если ПолеВыбора.Расположение = РасположениеПоляКомпоновкиДанных.Горизонтально Тогда 
				ВыводитьПоказателиВРазныхКолонках = Истина;
			Иначе 
				ВыводитьПоказателиВРазныхКолонках = Ложь;
			КонецЕсли;			
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьГруппировки(Структура, ДоступныеПоляГруппировок)
	
	Если Структура.Количество() > 0 Тогда 
		ПерваяГруппировка = Структура[0];
		
		Если ПерваяГруппировка.ПоляГруппировки.Элементы.Количество() > 0 Тогда 
			
			ДоступноеПолеГруппировки = Неопределено;
			
			ПолеГруппировки = ПерваяГруппировка.ПоляГруппировки.Элементы[0];
			Если Лев(Строка(ПолеГруппировки.Поле), 8) = "Периоды." Тогда 
				ГруппаПериоды = ДоступныеПоляГруппировок.Элементы.Найти("Периоды");
				Если ГруппаПериоды <> Неопределено Тогда 
					ДоступноеПолеГруппировки = ДоступныеПоляГруппировок.Элементы.Найти("Периоды").Элементы.Найти(Строка(ПолеГруппировки.Поле));
				КонецЕсли;
			Иначе
				ДоступноеПолеГруппировки = ДоступныеПоляГруппировок.Элементы.Найти(Строка(ПолеГруппировки.Поле));
			КонецЕсли;
			
			Если ДоступноеПолеГруппировки <> Неопределено Тогда 
				НоваяСтрока = Группировка.Добавить();
				НоваяСтрока.Поле = Строка(ПолеГруппировки.Поле);
				НоваяСтрока.Использование = ПерваяГруппировка.Использование;
				НоваяСтрока.Представление = ДоступноеПолеГруппировки.Заголовок;
				Если ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия Тогда 
					НоваяСтрока.ТипГруппировки = 1;
				ИначеЕсли ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда 
					НоваяСтрока.ТипГруппировки = 2;
				Иначе 
					НоваяСтрока.ТипГруппировки = 0;
				КонецЕсли;
				
				ЗаполнитьГруппировки(ПерваяГруппировка.Структура, ДоступныеПоляГруппировок);
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСтандартныеНастройкиОтчета(Компоновщик) Экспорт 
	
	УстановитьСтандартныеНастройкиВКомпоновщик(Компоновщик);
	ЗаполнитьТабличныеЧастиОтчетаПоКомпоновщику(Компоновщик);
	
КонецПроцедуры

Функция ФорматнаяСтрокаПоПериоду(ПолеПериод)
	
	Период = Сред(ПолеПериод, 15);
	
	ФорматнаяСтрока = "";
	
	Если Период = "День" Тогда
		ФорматнаяСтрока = "ДФ=dd.MM.yyyy";
	ИначеЕсли Период = "Неделя" Тогда
		ФорматнаяСтрока = "ДФ='""Неделя с"" dd.MM.yyyy ""'";
	ИначеЕсли Период = "Декада" Тогда
		ФорматнаяСтрока = "ДФ='""Декада с"" dd.MM.yyyyг ""'";			
	ИначеЕсли Период = "Месяц" Тогда
		ФорматнаяСтрока = "ДФ='MMMM yyyy ""г"".'";
	ИначеЕсли Период = "Квартал" Тогда
		ФорматнаяСтрока = "ДФ='q"" квартал"" yyyy ""г.""'";	
	ИначеЕсли Период = "Полугодие" Тогда
		ФорматнаяСтрока = "ДФ='""Полугодие с"" dd.MM.yyyy ""'";
	ИначеЕсли Период = "Год" Тогда
		ФорматнаяСтрока = "ДФ='yyyy ""г.""'";
	КонецЕсли;
	
	Возврат ФорматнаяСтрока;
	
КонецФункции

Процедура ИнициализацияРасшифровкиПоНастройкам(ПараметрыРасшифровки, КлючФормы) Экспорт 
	
	ПериодПредставлениеЗначение = Новый Соответствие;
	ПериодПредставлениеЗначение.Вставить("По годам", "ПериодГод");
	ПериодПредставлениеЗначение.Вставить("По полугодиям", "ПериодПолугодие");
	ПериодПредставлениеЗначение.Вставить("По кварталам", "ПериодКвартал");
	ПериодПредставлениеЗначение.Вставить("По месяцам", "ПериодМесяц");
	ПериодПредставлениеЗначение.Вставить("По декадам", "ПериодДекада");
	ПериодПредставлениеЗначение.Вставить("По неделям", "ПериодНеделя");
	ПериодПредставлениеЗначение.Вставить("По дням", "ПериодДень");
	
	Расшифровка = ПолучитьИзВременногоХранилища(ПараметрыРасшифровки.АдресРасшифровки);	
	Раздел = ПараметрыРасшифровки.Раздел;
	ДатаНачала = ПараметрыРасшифровки.ДатаНачала;
	ДатаОкончания = ПараметрыРасшифровки.ДатаОкончания;
	
	СКД = СхемаПоРазделу();
	АдресСхемы = ПоместитьВоВременноеХранилище(СКД, КлючФормы);
	идн = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	КомпоновщикНастроек.Инициализировать(идн);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Расшифровка.Настройки);
	НовыеНастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	НовыеНастройкиОтчета.Структура.Очистить();
	Индекс = НовыеНастройкиОтчета.Выбор.Элементы.Количество() - 1;
	Пока Индекс >= 0 Цикл                                                         
		ВыбранноеПоле = НовыеНастройкиОтчета.Выбор.Элементы[Индекс];
		Если ТипЗнч(ВыбранноеПоле) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда 
			НовыеНастройкиОтчета.Выбор.Элементы.Удалить(ВыбранноеПоле);
		КонецЕсли;		
		
		Индекс = Индекс - 1 ;		
	КонецЦикла;	
	
	Период = ПериодПредставлениеЗначение.Получить(ПараметрыРасшифровки.ПолеРасшифровки);
		
	Структура = НовыеНастройкиОтчета.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	Если Период = Неопределено Тогда
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ПараметрыРасшифровки.ПолеРасшифровки);
	Иначе 
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Периоды." + Период);
	КонецЕсли;
	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	Если Не Период = Неопределено Тогда
		УсловноеОформление = НовыеНастройкиОтчета.УсловноеОформление.Элементы.Добавить();
		УсловноеОформление.Использование = Истина;
		ПолеУсловногоОформления = УсловноеОформление.Поля.Элементы.Добавить();
		ПолеУсловногоОформления.Использование = Истина;
		ПолеУсловногоОформления.Поле = ПолеГруппировки.Поле;
		УсловноеОформление.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Формат"), ФорматнаяСтрокаПоПериоду(ПолеГруппировки.Поле));
	КонецЕсли;
	
	НовыеНастройкиОтчета.Порядок.Элементы.Очистить();
	НовыеНастройкиОтчета.УсловноеОформление.Элементы.Очистить();
	
	Для Каждого Элемент Из ПараметрыРасшифровки.Отборы Цикл 
		
		ИзменяемыйОтбор = Неопределено;
		Поле = Новый ПолеКомпоновкиДанных(Элемент.Ключ);
		Для Каждого ЭлементОтбора Из НовыеНастройкиОтчета.Отбор.Элементы Цикл 
			Если ЭлементОтбора.ЛевоеЗначение = Поле Тогда 
				ИзменяемыйОтбор = ЭлементОтбора;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ИзменяемыйОтбор = Неопределено Тогда 
			ЭлементОтбора = НовыеНастройкиОтчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Поле;
		КонецЕсли;
		
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Элемент.Значение;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		
	КонецЦикла;
		
	КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройкиОтчета);

	ЗаполнитьТабличныеЧастиОтчетаПоКомпоновщику(КомпоновщикНастроек);
	
КонецПроцедуры

#Область Инициализация

мСтруктураКэшДанных = Новый Структура;

#КонецОбласти 

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
